/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   op_e_sub.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nalexand <nalexand@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/07 21:32:01 by nalexand          #+#    #+#             */
/*   Updated: 2019/08/09 20:25:56 by nalexand         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "corewar.h"

/*
**	5: sub {T_REG}, {T_REG}, {T_REG} DSIZE 4
**
**	Задачи:
**	- От значения регистра, переданного в качестве первого аргумента,
**	отнять значение регистра, который был передан в качестве второго аргумента.
**	Полученный результат записать в регистр, который был передан в качестве третьего аргумента.
**	Если записанный результат был равен нулю,
**	то значение carry сделать равным 1.
**	Если результат был не нулевой, то сделать равным 0.
*/

void	cw_sub(void *core, t_list *carriage)
{
	/*
	int		arg;

	core = NULL;
	CRG->reg[CRG->op[4] - 1] = CRG->reg[CRG->op[2] - 1] - CRG->reg[CRG->op[3] - 1];
	if (CRG->reg[CRG->op[4] - 1] == 0)
		CRG->carry = 1;
	else
		CRG->carry = 0;
	ft_printf("%{gre}s", "SUB IS DONE!\n");
	print_operation_info(CRG->op);
	*/
}
